const messagesInuarainian = {
  START: {
    BUTTON: {
      TYPE_LANGUAGE: 'Українською'
    }
  },
  SELECT_ROLE: {
    DEFAULT: 'Ви шукаєте роботу чи пропонуєте?',
    BUTTON: {
      WORKER: 'Шукаю',
      EMPLOYER: 'Пропоную'
    }
  },
  CATEGORY: {
    DEFAULT: 'Будь ласка, оберіть одну з категорій',
    ITEM: 'Будь ласка, оберіть один з пунктів для категорії <strong>{category}</strong>'
  },
  EXPERIENSE: {
    DEFAULT: 'Будь ласка, оберіть якій у вас досвід',
    BUTTON: {
      NOTHING: 'Немає досвіду',
      HALF_YEAR: 'Півроку',
      ONE_YEAR: '1 рік',
      ONE_AND_HALF_YEAR: 'Півтора роки',
      TWO_YEARS: '2 роки',
      TWO_AND_HALF_YEARS: 'Два з половиною роки',
      THREE_YEARS: '3 роки',
      FOUR_YEARS: '4 роки',
      FIVE_YEARS: '5 роки',
      SIX_YEARS: '6 роки',
      SEVEN_YEARS: '7 роки',
      EIGHT_YEARS: '8 роки',
      NINE_YEARS: '9 роки',
      TEN_YEARS: '10 роки',
      MORE_THEN_TEN_YEARS: 'Більше 10 років'
    }
  },
  SALARY: {
    DEFAULT:
      'Будь ласка, вкажіть на яку зарплату (фінальну, з усіма податками) ви претендуєте. Вкажіть цифру у доларах',
    ERROR:
      'Нам жаль, але ми не знаємо такого числа. Ви бажаєте спробувати вказати зарплату знову?'
  },
  POSITION: {
    DEFAULT: 'Будь ласка, вкажіть на яку позицію ви претендуєте'
  },
  ENGLISH_LEVEL: {
    DEFAULT: 'Будь ласка, оберіть який рівень англійської мови ви маєте',
    BUTTON: {
      NO_ENGLISH: 'No English',
      A1: 'Begginner/Elementary',
      A2: 'Pre-Intermediate',
      B1: 'Intermediate',
      B2: 'Upper-Intermediate',
      C1: 'Advanced/Fluent'
    }
  },
  CITIES: {
    DEFAULT: 'Будь ласка, оберіть ряд міст у яких ви шукаєте роботу',
    EXIST_CITIES: '\n\nВже обран ряд міст: <strong>{cities}</strong>'
  },
  DEFAULT_BUTTON: {
    EDIT: 'Редагувати ✏️',
    BACK: 'Назад ⬅️',
    YES: 'Так ✅',
    NO: 'Ні ❌',
    ADD: '{item} ➕',
    DELETE: '{item} 🗑',
    SAVE: 'Зберегти ✅'
  },
  SUCCESS: 'Був обран пункт <strong>{item}</strong>'
};

export default messagesInuarainian;
